numbers = [2, 4, 6, 8, 10]
print(numbers) # Список чисел
languages = ['Python', 'C#', 'C++', 'Java']
print(*languages) # Выводим каждый элемент отдельно, но в одной строке. Работает для любых методов, можно передавать элементы как отдельные параметры
info = ['Timur', 1992, 61.5]
print(info) # Можно хранить любые типы в одном списке
mylist = [] # Создание пустого списка
mylist1 = list() # Еще один способ
lst = list('sdfhaza,ds') # Создание списка символов из строки
print(lst)
print(list(range(1, 7, 2))) # Создание списка из массива чисел